In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("nyc_weather.csv")

In [5]:
df = pd.read_excel("weather_data.xlsx")

In [7]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']
}
df = pd.DataFrame(weather_data)

In [8]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [9]:

weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
df = pd.DataFrame(weather_data, columns=["Date","Temperature","windspeed","Event"])

In [10]:
df

       Date  Temperature  windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [11]:
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
    
]
df = pd.DataFrame(weather_data)

In [12]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [32]:
df = pd.read_clipboard()

In [33]:
df

,,,,World,"5,466,278","+68,328","345,592","+1,984","2,287,641","2,833,045","53,208",701,44.3
1,USA,"1,677,258","+10,430","99,040",+357,"451,176","1,127,042","17,155","5,070",299,"14,635,920","44,244","330,801,130"
2,Brazil,"352,744","+5,346","22,291",+278,"142,587","187,866","8,318","1,661",105,"735,224","3,461","212,401,542"
3,Russia,"344,481","+8,599","3,541",+153,"113,299","227,641","2,300","2,361",24,"8,685,305","59,518","145,928,144"
4,Spain,"282,852",+482,"28,752",+74,"196,958","57,142",854,"6,050",615,"3,556,567","76,071","46,752,950"
5,UK,"259,559","+2,405","36,793",+118,NaN,NaN,"1,559","3,826",542,"3,458,905","50,979","67,849,102"
6,Italy,"229,858",+531,"32,785",+50,"140,479","56,594",553,"3,801",542,"3,447,012","57,003","60,470,714"
7,France,"182,584",+115,"28,367",+35,"64,617","89,600","1,655","2,798",435,"1,384,633","21,218","65,258,794"
8,Germany,"180,219",+233,"8,371",+5,"160,300","11,548",889,"2,152",100,"3,595,059","42,923","83,756,505"
9,Turkey,"156,827","+1,141","4,340",+32,"118,694","33,793",769,"1,862",52,"1,832,262","21,750","84,242,466"
10,India,"138,536","+7,113","4,024",+156,"57,692","76,820","8,944",100,3,"2,943,421","2,135","1,378,566,974"
11,Iran,"135,701","+2,180","7,417",+58,"105,801","22,483","2,615","1,618",88,"800,519","9,544","83,877,328"
12,Peru,"115,754","3,373","47,915","64,466",909,"3,516",102,"788,341","23,946","32,922,175",None,None